---
kind: property
id: P:Autodesk.Revit.DB.InSessionViewSheetSet.Views
source: html/fadd0919-968c-26d7-b3e2-1454ad194312.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet.Views Property

The views.

## Syntax (C#)
```csharp
public virtual ViewSet Views { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input views is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the set operation failed due to invalid view which cannot be printed.